app/views/user_settings/_form.html.erb

SELECT "app_settings".* FROM "app_settings"
---
<% @user_setting.setting.each do |name, value| %>
<% @settings =  AppSetting.all %>