app/views/offers/_form.html.erb

      <%= f.input :regions do %>
        <%= f.input_field :regions, as: :select, collection: Region.all, input_html: {class: "agency-settings-field", id: ""} %>
---
SELECT "regions".* FROM "regions"