app/views/schools/_form.html.erb

  <%= f.input :name %>
  <% cities = City.all.order(:name) %>
  <% countries = Country.all.order(:name) %>
---
SELECT "cities".* FROM "cities"   ORDER BY "cities"."name" ASC
SELECT "countries".* FROM "countries"   ORDER BY "countries"."name" ASC