app/controllers/offers_controller.rb

  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save
---
INSERT INTO "offers" ("course_id", "created_at", "end_date", "flag", "max_num_weeks", "min_num_weeks", "num_of_seats", "pay_within", "regions", "regular_price", "school_id", "start_date", "updated_at", "weekly_limit", "weekly_price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)