app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = ?
---
  def index
    @orders = current_user.orders.all

INSERT INTO "orders" ("created_at", "expire_date", "num_seats", "num_weeks", "offer_code", "offer_id", "start_date", "state", "total_price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def new
    @order = Order.new(order_params)
    @order.user = current_user
    @order.offer_code = SecureRandom.hex(8)
    @order.save