app/controllers/schools_controller.rb

  def index
    @schools = current_user.schools.all
    @school = School.new
    @user_offers_count = current_user.offers.count
---
SELECT "schools".* FROM "schools"  WHERE "schools"."user_id" = ?
SELECT COUNT(*) FROM "offers" INNER JOIN "schools" ON "offers"."school_id" = "schools"."id" WHERE "schools"."user_id" = ?

    def set_school
      @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools"  WHERE "schools"."id" = ? LIMIT 1