app/controllers/searches_controller.rb

INSERT INTO "searches" ("country_id", "created_at", "num_seats", "num_weeks", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @search = Search.new(search_params)


    respond_to do |format|
      if @search.save

SELECT  "searches".* FROM "searches"  WHERE "searches"."id" = ? LIMIT 1
SELECT  "regions".* FROM "regions"  WHERE (name = 'All')  ORDER BY "regions"."id" ASC LIMIT 1
SELECT  "countries".* FROM "countries"  WHERE "countries"."id" = ? LIMIT 1
SELECT  "regions".* FROM "regions"  WHERE "regions"."id" = ? LIMIT 1
---
  def seat
    @seat = Seat.all
    @search = Search.new
    @search.user_id = current_user.id
    @last_search = Search.find(params[:id])
    all_region_id = Region.where("name = ?", "All").first.id
    @offers = Offer.where('? between start_date and end_date and ? between min_num_weeks and max_num_weeks and (regions = ? or regions = ?)', @last_search.start_date, @last_search.num_weeks, @last_search.country.region.id.to_s, all_region_id.to_s)