app/controllers/user_settings_controller.rb

  def index
    @user_settings = UserSetting.all
---
SELECT  "user_settings".* FROM "user_settings"  WHERE "user_settings"."user_id" = ? LIMIT 1

  def edit
    if current_user.user_setting.id != @user_setting.id
      #head status: 404
      render 'public/404.html'
      #redirect_to '/'
    end

    @num_offers = Offer.all.count
---
SELECT COUNT(*) FROM "offers"

    def set_user_setting
      if UserSetting.exists?(params[:id])
        @user_setting = UserSetting.find(params[:id])
---
SELECT  "user_settings".* FROM "user_settings"  WHERE "user_settings"."id" = ? LIMIT 1