app/controllers/user_states_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "user_states".* FROM "user_states"  WHERE (user_id = '2')
UPDATE "user_states" SET "active" = ?, "updated_at" = ? WHERE "user_states"."id" = 102
INSERT INTO "user_states" ("active", "created_at", "updated_at", "user_id", "user_state") VALUES (?, ?, ?, ?, ?)
---
  def setState
    if current_user == User.find_by_id(params[:user_id]) || User.find_by_id(params[:user_id]).current_active_state == 'admin'
      session[:return_to] ||= request.referer
      redirect_to session.delete(:return_to), :flash => { :error => "You can't change your account state!" }
    else
      other_user_states = UserState.where('user_id = ?', params[:user_id])
      if other_user_states
        other_user_states.each do |s|
          s.active = false
          s.save
        end
      end

      @user_state = UserState.new
      @user_state.user_state = params[:user_state]
      @user_state.user_id = params[:user_id]
      @user_state.active = true
      @user_state.save