app/models/school.rb

SELECT AVG("rates"."stars") AS avg_id FROM "rates"  WHERE (rateable_type = 'School' and rateable_id = 3)
---
	def avg_rate
		q = Rate.where('rateable_type = ? and rateable_id = ?' ,'School', self.id).average(:stars).to_i