app/models/user.rb

SELECT "user_states".* FROM "user_states"  WHERE "user_states"."user_id" = ? AND (active = 't')
SELECT COUNT(*) FROM "user_states"  WHERE "user_states"."user_id" = ? AND (active = 't')
---
  def current_active_state
    states = self.user_states.where('active = ?', true)
    if states.count > 0

INSERT INTO "agencies" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)
---
  def create_agency_record
    agency = Agency.new
    agency.user = self
    agency.name = self.agency_name
    agency.save

SELECT "app_settings".* FROM "app_settings"
INSERT INTO "user_settings" ("created_at", "setting", "updated_at", "user_id") VALUES (?, ?, ?, ?)
---
  def initiate_user_settings
    default_settings = {}
    AppSetting.all.each do |set|
      default_settings[set.name] = set.options[0]
    end

    UserSetting.new(user: self, setting: default_settings).save